@sethvargo:
Console output for `terraform apply`:

```
zsombor@MacBook-Pro cw-en-verification-8 % terraform apply
module.en.random_id.db-apikey-db-hmac: Refreshing state... [id=G3JKFXImJxoisfOGNiJanRkK9zuZqmTAm4uL4NJTqL0316GHKZ9UL4c9FDJR7OywGB-p7cGJvQKvugjN2LZlblcW2bzteGNly7zeigaPK6h-9yKPXpFxo9_cjGGdGbK-f5DvMIcsDs2PD7zTj7upPhdK_XBI3KI1o64C0DX5kPA]
module.en.random_id.cookie-hmac-key: Refreshing state... [id=Ka3GglUyTgYWZBypqdlI30FMsSrTZb1RDCSf2d3VnMw]
module.en.random_id.cookie-encryption-key: Refreshing state... [id=Yv7I2ueG1DYnaOcmEz3nnxrLitLtOrP18Ga_8m7r3wM]
module.en.random_id.csrf-token: Refreshing state... [id=QnOBZRqSRTIsy2_7fgA0asllQ9ZDn3Ty-mHqgyhZUl0]
module.en.random_string.db-name: Refreshing state... [id=dbuhq]
module.en.random_password.db-password: Refreshing state... [id=none]
module.en.random_id.db-verification-code-hmac: Refreshing state... [id=qrqyhoigX6JMZNzdPxVNIUDN-nM4iAEiuE3DnHWop2-bJ4X1zC5G0LcdGTTVNPuaOJm8-Xiq3OEqKxsxmIaZmvuS1zTd8jzO3uiZOAvUMR7qiLq-zGqOVi_j8cVPn6AILmPZQV__MtNJ02bCHSnv8tsi11KCSVCFQlSPIn6Neh4]
module.en.random_id.db-apikey-sig-hmac: Refreshing state... [id=YAi5QFCYYXgiTrQ3W6JXbolahIGjRolbg4EVOasLwCyCibJ_M9VPpIWdOFdCxHiHXh1W6rnaL13BODXk3JEXczkbdDPnNQcI1HlblAnsVMdNAdsQXdN8h10IQ56StvZ6OaH-NtNxPIn2j1mmhyJmlmJ9_dFweD4o5L9cxmlRmLI]
module.en.google_service_account.adminapi: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_service_account.server: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/servicenetworking.googleapis.com]
module.en.google_project_service.services["run.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/run.googleapis.com]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/vpcaccess.googleapis.com]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/sqladmin.googleapis.com]
module.en.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/compute.googleapis.com]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/identitytoolkit.googleapis.com]
module.en.google_project_service.services["sql-component.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/sql-component.googleapis.com]
module.en.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/iam.googleapis.com]
module.en.google_project_service.services["cloudbuild.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/cloudbuild.googleapis.com]
module.en.google_project_service.services["redis.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/redis.googleapis.com]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/cloudidentity.googleapis.com]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/cloudkms.googleapis.com]
module.en.data.google_project.project: Refreshing state... [id=projects/cw-en-verification-8]
module.en.google_project_service.services["storage.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/storage.googleapis.com]
module.en.google_project_service.services["firebase.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/firebase.googleapis.com]
module.en.google_project_service.services["cloudscheduler.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/cloudscheduler.googleapis.com]
module.en.google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/cloudresourcemanager.googleapis.com]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/secretmanager.googleapis.com]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Refreshing state... [id=cw-en-verification-8/containerregistry.googleapis.com]
module.en.google_service_account.cleanup: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_service_account.apiserver: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_service_account.e2e-runner: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_compute_url_map.urlmap-http: Refreshing state... [id=projects/cw-en-verification-8/global/urlMaps/https-redirect]
module.en.google_project_iam_member.adminapi-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-8/roles/logging.logWriter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-8/roles/monitoring.metricWriter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-8/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-8/roles/cloudtrace.agent/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.firebase-admin: Refreshing state... [id=cw-en-verification-8/roles/firebaseauth.admin/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-8/roles/cloudtrace.agent/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-8/roles/monitoring.metricWriter/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-8/roles/logging.logWriter/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-8/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-8/roles/cloudtrace.agent/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-8/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-8/roles/cloudtrace.agent/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_service_account.cleanup-invoker: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-cleanup-invoker-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-8/roles/monitoring.metricWriter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-8/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-8/roles/logging.logWriter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_app_engine_application.app: Refreshing state... [id=cw-en-verification-8]
module.en.google_service_account.e2e-runner-invoker: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-e2e-runner-invoker-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-8/roles/monitoring.metricWriter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-8/roles/logging.logWriter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/monitoring.metricWriter"]: Refreshing state... [id=cw-en-verification-8/roles/monitoring.metricWriter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/cloudtrace.agent"]: Refreshing state... [id=cw-en-verification-8/roles/cloudtrace.agent/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=cw-en-verification-8/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/logging.logWriter"]: Refreshing state... [id=cw-en-verification-8/roles/logging.logWriter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret.db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-verification-code-hmac]
module.en.google_secret_manager_secret.db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-db-hmac]
module.en.google_storage_bucket.cloudbuild-cache: Refreshing state... [id=cw-en-verification-8-cloudbuild-cache]
module.en.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/cw-en-verification-8/global/addresses/private-ip-address]
module.en.google_secret_manager_secret.db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-sig-hmac]
module.en.google_kms_key_ring.verification: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification]
module.en.google_service_account_iam_member.cloudbuild-deploy-e2e-runner: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_vpc_access_connector.connector: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/connectors/serverless-vpc-connector]
module.en.google_secret_manager_secret.cookie-encryption-key: Refreshing state... [id=projects/cw-en-verification-8/secrets/cookie-encryption-key]
module.en.google_service_account_iam_member.cloudbuild-deploy-adminapi: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_service_account_iam_member.cloudbuild-deploy-server: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_service_account_iam_member.cloudbuild-deploy-apiserver: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_project_iam_member.cloudbuild-sql: Refreshing state... [id=cw-en-verification-8/roles/cloudsql.client/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_project_iam_member.cloudbuild-deploy: Refreshing state... [id=cw-en-verification-8/roles/run.admin/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_service_account_iam_member.cloudbuild-deploy-cleanup: Refreshing state... [id=projects/cw-en-verification-8/serviceAccounts/en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret.csrf-token: Refreshing state... [id=projects/cw-en-verification-8/secrets/csrf-token]
module.en.google_firebase_project.default: Refreshing state... [id=projects/cw-en-verification-8]
module.en.google_secret_manager_secret.cookie-hmac-key: Refreshing state... [id=projects/cw-en-verification-8/secrets/cookie-hmac-key]
module.en.google_secret_manager_secret.db-secret["password"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-password]
module.en.google_secret_manager_secret.db-secret["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslrootcert]
module.en.google_secret_manager_secret.db-secret["sslcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslcert]
module.en.google_secret_manager_secret.db-secret["sslkey"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslkey]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-verification-code-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.db-verification-code-hmac: Refreshing state... [id=projects/979752996327/secrets/db-verification-code-hmac/versions/1]
module.en.google_storage_bucket_iam_member.cloudbuild-cache: Refreshing state... [id=b/cw-en-verification-8-cloudbuild-cache/roles/storage.objectAdmin/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.db-apikey-db-hmac: Refreshing state... [id=projects/979752996327/secrets/db-apikey-db-hmac/versions/1]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-db-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.db-apikey-sig-hmac: Refreshing state... [id=projects/979752996327/secrets/db-apikey-sig-hmac/versions/1]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-sig-hmac: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fcw-en-verification-8%2Fglobal%2Fnetworks%2Fdefault:servicenetworking.googleapis.com]
module.en.google_kms_key_ring_iam_member.server-verification-key-admin: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/roles/cloudkms.admin/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_kms_key_ring_iam_member.server-verification-key-signer-verifier: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/roles/cloudkms.signerVerifier/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_kms_crypto_key.database-encrypter: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter]
module.en.google_kms_crypto_key.certificate-signer: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer]
module.en.google_kms_key_ring_iam_member.kms-signerverifier: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/roles/cloudkms.signerVerifier/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_kms_crypto_key.token-signer: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/token-signer]
module.en.google_secret_manager_secret_iam_member.server-cookie-encryption-key: Refreshing state... [id=projects/cw-en-verification-8/secrets/cookie-encryption-key/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.cookie-encryption-key-version: Refreshing state... [id=projects/979752996327/secrets/cookie-encryption-key/versions/1]
module.en.google_secret_manager_secret_version.csrf-token-version: Refreshing state... [id=projects/979752996327/secrets/csrf-token/versions/1]
module.en.google_secret_manager_secret_iam_member.server-csrf: Refreshing state... [id=projects/cw-en-verification-8/secrets/csrf-token/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_firebase_web_app.default: Refreshing state... [id=projects/cw-en-verification-8/webApps/1:979752996327:web:c8cf499d2a14d7d95d4142]
module.en.google_secret_manager_secret_version.cookie-hmac-key-version: Refreshing state... [id=projects/979752996327/secrets/cookie-hmac-key/versions/1]
module.en.google_secret_manager_secret_iam_member.server-cookie-hmac-key: Refreshing state... [id=projects/cw-en-verification-8/secrets/cookie-hmac-key/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["password"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["password"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["password"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cloudbuild-db-pwd: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["password"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslrootcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslkey"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["password"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslcert"]: Refreshing state... [id=projects/cw-en-verification-8/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.null_resource.build: Refreshing state... [id=3360068009242415679]
module.en.google_kms_crypto_key_iam_member.apiserver-database-encrypter: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.database-database-encrypter: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:979752996327@cloudbuild.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.e2e-runner-database-encrypter: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.adminapi-database-encrypter: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.cleanup-database-encrypter: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.server-database-encrypter: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-server-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_sql_database_instance.db-inst: Refreshing state... [id=en-verification]
module.en.google_redis_instance.cache: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/instances/verification-cache]
module.en.data.google_kms_crypto_key_version.certificate-signer-version: Refreshing state... [id=//cloudkms.googleapis.com/v1/projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer/cryptoKeyVersions/1]
module.en.data.google_kms_crypto_key_version.token-signer-version: Refreshing state... [id=//cloudkms.googleapis.com/v1/projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/token-signer/cryptoKeyVersions/1]
module.en.data.google_firebase_web_app_config.default: Refreshing state... [id=1:979752996327:web:c8cf499d2a14d7d95d4142]
module.en.google_sql_database.db: Refreshing state... [id=projects/cw-en-verification-8/instances/en-verification/databases/verification]
module.en.google_sql_user.user: Refreshing state... [id=verification//en-verification]
module.en.google_sql_ssl_cert.db-cert: Refreshing state... [id=projects/cw-en-verification-8/instances/en-verification/sslCerts/fc53558638d06248c05fe8b712c691a5550d7dbb]
module.en.google_secret_manager_secret_version.db-secret-version["password"]: Refreshing state... [id=projects/979752996327/secrets/db-password/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["sslcert"]: Refreshing state... [id=projects/979752996327/secrets/db-sslcert/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["sslkey"]: Refreshing state... [id=projects/979752996327/secrets/db-sslkey/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["sslrootcert"]: Refreshing state... [id=projects/979752996327/secrets/db-sslrootcert/versions/1]
module.en.null_resource.migrate: Refreshing state... [id=4331290786721627435]
module.en.local_file.env[0]: Refreshing state... [id=cccba2f84790e8f46910b82d785fb2df6500fe5b]
module.en.google_cloud_run_service.adminapi: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-8/services/adminapi]
module.en.google_cloud_run_service.cleanup: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-8/services/cleanup]
module.en.google_cloud_run_service.apiserver: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-8/services/apiserver]
module.en.google_cloud_run_service.server: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-8/services/server]
module.en.google_cloud_run_service_iam_member.cleanup-invoker: Refreshing state... [id=v1/projects/cw-en-verification-8/locations/us-central1/services/cleanup/roles/run.invoker/serviceaccount:en-cleanup-invoker-sa@cw-en-verification-8.iam.gserviceaccount.com]
module.en.google_cloud_run_service_iam_member.adminapi-public: Refreshing state... [id=v1/projects/cw-en-verification-8/locations/us-central1/services/adminapi/roles/run.invoker/allusers]
module.en.google_compute_region_network_endpoint_group.adminapi: Refreshing state... [id=projects/cw-en-verification-8/regions/us-central1/networkEndpointGroups/adminapi]
module.en.google_cloud_run_service_iam_member.apiserver-public: Refreshing state... [id=v1/projects/cw-en-verification-8/locations/us-central1/services/apiserver/roles/run.invoker/allusers]
module.en.google_compute_region_network_endpoint_group.apiserver: Refreshing state... [id=projects/cw-en-verification-8/regions/us-central1/networkEndpointGroups/apiserver]
module.en.google_cloud_run_service.e2e-runner: Refreshing state... [id=locations/us-central1/namespaces/cw-en-verification-8/services/e2e-runner]
module.en.google_cloud_run_service_iam_member.server-public: Refreshing state... [id=v1/projects/cw-en-verification-8/locations/us-central1/services/server/roles/run.invoker/allusers]
module.en.google_compute_region_network_endpoint_group.server: Refreshing state... [id=projects/cw-en-verification-8/regions/us-central1/networkEndpointGroups/server]
module.en.google_cloud_scheduler_job.cleanup-worker: Refreshing state... [id=projects/cw-en-verification-8/locations/us-central1/jobs/cleanup-worker]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.en.google_cloud_run_service.e2e-runner is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "e2e-runner" {
        autogenerate_revision_name = true
      ~ id                         = "locations/us-central1/namespaces/cw-en-verification-8/services/e2e-runner" -> (known after apply)
        location                   = "us-central1"
        name                       = "e2e-runner"
      ~ project                    = "cw-en-verification-8" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Cloud Run error: Container failed to start. Failed to start and then listen on the port defined by the PORT environment variable. Logs for this revision might contain more information."
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Cloud Run error: Container failed to start. Failed to start and then listen on the port defined by the PORT environment variable. Logs for this revision might contain more information."
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "Cloud Run error: Container failed to start. Failed to start and then listen on the port defined by the PORT environment variable. Logs for this revision might contain more information."
                      - reason  = ""
                      - status  = "Unknown"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "e2e-runner-srjs8"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)

      ~ metadata {
          ~ annotations      = {
              - "run.googleapis.com/launch-stage"  = "BETA"
              - "serving.knative.dev/creator"      = "zsombor@covidwatch.org"
              - "serving.knative.dev/lastModifier" = "zsombor@covidwatch.org"
            } -> (known after apply)
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {
              - "cloud.googleapis.com/location" = "us-central1"
            } -> (known after apply)
          ~ namespace        = "cw-en-verification-8" -> (known after apply)
          ~ resource_version = "AAWu4hxQ4d4" -> (known after apply)
          ~ self_link        = "/apis/serving.knative.dev/v1/namespaces/979752996327/services/e2e-runner" -> (known after apply)
          ~ uid              = "e48b11d8-de54-4e25-a8fe-516bc9c713e1" -> (known after apply)
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale"        = "1000" -> null
                    "run.googleapis.com/vpc-access-connector" = "projects/cw-en-verification-8/locations/us-central1/connectors/serverless-vpc-connector"
                }
              ~ generation       = 0 -> (known after apply)
              - labels           = {} -> null
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
                service_account_name  = "en-verification-e2e-runner-sa@cw-en-verification-8.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                    image   = "gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/e2e-runner:initial"

                    env {
                        name  = "CACHE_REDIS_HOST"
                        value = "10.15.1.4"
                    }
                    env {
                        name  = "CACHE_REDIS_PORT"
                        value = "6379"
                    }
                    env {
                        name  = "CACHE_TYPE"
                        value = "REDIS"
                    }
                    env {
                        name  = "CERTIFICATE_KEY_MANAGER"
                        value = "GOOGLE_CLOUD_KMS"
                    }
                    env {
                        name  = "CERTIFICATE_SIGNING_KEY"
                        value = "projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer/cryptoKeyVersions/1"
                    }
                    env {
                        name  = "CERTIFICATE_SIGNING_KEYRING"
                        value = "projects/cw-en-verification-8/locations/us-central1/keyRings/verification"
                    }
                    env {
                        name  = "CSRF_AUTH_KEY"
                        value = "secret://projects/979752996327/secrets/csrf-token/versions/1"
                    }
                    env {
                        name  = "DB_APIKEY_DATABASE_KEY"
                        value = "secret://projects/979752996327/secrets/db-apikey-db-hmac/versions/1"
                    }
                    env {
                        name  = "DB_APIKEY_SIGNATURE_KEY"
                        value = "secret://projects/979752996327/secrets/db-apikey-sig-hmac/versions/1"
                    }
                    env {
                        name  = "DB_ENCRYPTION_KEY"
                        value = "projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter"
                    }
                    env {
                        name  = "DB_HOST"
                        value = "10.15.0.2"
                    }
                    env {
                        name  = "DB_KEY_MANAGER"
                        value = "GOOGLE_CLOUD_KMS"
                    }
                    env {
                        name  = "DB_NAME"
                        value = "verification"
                    }
                    env {
                        name  = "DB_PASSWORD"
                        value = "secret://projects/979752996327/secrets/db-password/versions/1"
                    }
                    env {
                        name  = "DB_SSLCERT"
                        value = "secret://projects/979752996327/secrets/db-sslcert/versions/1?target=file"
                    }
                    env {
                        name  = "DB_SSLKEY"
                        value = "secret://projects/979752996327/secrets/db-sslkey/versions/1?target=file"
                    }
                    env {
                        name  = "DB_SSLMODE"
                        value = "verify-ca"
                    }
                    env {
                        name  = "DB_SSLROOTCERT"
                        value = "secret://projects/979752996327/secrets/db-sslrootcert/versions/1?target=file"
                    }
                    env {
                        name  = "DB_USER"
                        value = "verification"
                    }
                    env {
                        name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                        value = "secret://projects/979752996327/secrets/db-verification-code-hmac/versions/1"
                    }
                    env {
                        name  = "FIREBASE_API_KEY"
                        value = "AIzaSyDBzUSZ95Il6Xa_7l9UX11qbr1gmOzinoQ"
                    }
                    env {
                        name  = "FIREBASE_APP_ID"
                        value = "1:979752996327:web:c8cf499d2a14d7d95d4142"
                    }
                    env {
                        name  = "FIREBASE_AUTH_DOMAIN"
                        value = "cw-en-verification-8.firebaseapp.com"
                    }
                    env {
                        name  = "FIREBASE_DATABASE_URL"
                        value = "https://cw-en-verification-8.firebaseio.com"
                    }
                    env {
                        name = "FIREBASE_MEASUREMENT_ID"
                    }
                    env {
                        name  = "FIREBASE_MESSAGE_SENDER_ID"
                        value = "979752996327"
                    }
                    env {
                        name  = "FIREBASE_PROJECT_ID"
                        value = "cw-en-verification-8"
                    }
                    env {
                        name  = "FIREBASE_STORAGE_BUCKET"
                        value = "cw-en-verification-8.appspot.com"
                    }
                    env {
                        name  = "HEALTH_AUTHORITY_CODE"
                        value = "com.example"
                    }
                    env {
                        name  = "KEY_SERVER"
                        value = "https://example.com/v1/publish"
                    }
                    env {
                        name  = "PROJECT_ID"
                        value = "cw-en-verification-8"
                    }
                    env {
                        name  = "TOKEN_KEY_MANAGER"
                        value = "GOOGLE_CLOUD_KMS"
                    }
                    env {
                        name  = "TOKEN_SIGNING_KEY"
                        value = "projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/token-signer/cryptoKeyVersions/1"
                    }
                    env {
                        name  = "VERIFICATION_ADMIN_API"
                        value = "https://adminapi-2ujofq5i2a-uc.a.run.app"
                    }
                    env {
                        name  = "VERIFICATION_SERVER_API"
                        value = "https://apiserver-2ujofq5i2a-uc.a.run.app"
                    }

                  ~ ports {
                      ~ container_port = 8080 -> (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  ~ resources {
                        limits   = {
                            "cpu"    = "1"
                            "memory" = "512Mi"
                        }
                      - requests = {} -> null
                    }
                }
            }
        }

      ~ traffic {
          ~ latest_revision = true -> (known after apply)
          ~ percent         = 100 -> (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service_iam_member.e2e-runner-invoker will be created
  + resource "google_cloud_run_service_iam_member" "e2e-runner-invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "serviceAccount:en-e2e-runner-invoker-sa@cw-en-verification-8.iam.gserviceaccount.com"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "e2e-runner"
    }

  # module.en.google_cloud_scheduler_job.e2e-default-workflow will be created
  + resource "google_cloud_scheduler_job" "e2e-default-workflow" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "e2e-default-workflow"
      + project          = (known after apply)
      + region           = "us-central1"
      + schedule         = "*/10 * * * *"
      + time_zone        = "America/Los_Angeles"

      + http_target {
          + http_method = "GET"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = "en-e2e-runner-invoker-sa@cw-en-verification-8.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.en.google_cloud_scheduler_job.e2e-revise-workflow will be created
  + resource "google_cloud_scheduler_job" "e2e-revise-workflow" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "e2e-revise-workflow"
      + project          = (known after apply)
      + region           = "us-central1"
      + schedule         = "*/10 * * * *"
      + time_zone        = "America/Los_Angeles"

      + http_target {
          + http_method = "GET"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = "en-e2e-runner-invoker-sa@cw-en-verification-8.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.en.null_resource.migrate is tainted, so must be replaced
-/+ resource "null_resource" "migrate" {
      ~ id = "4331290786721627435" -> (known after apply)
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ en = {
        adminapi_url                    = "https://adminapi-2ujofq5i2a-uc.a.run.app"
        apiserver_url                   = "https://apiserver-2ujofq5i2a-uc.a.run.app"
        cleanup_url                     = "https://cleanup-2ujofq5i2a-uc.a.run.app"
        cloudscheduler_location         = "us-central1"
        cookie_keys                     = "secret://projects/979752996327/secrets/cookie-hmac-key/versions/1,secret://projects/979752996327/secrets/cookie-encryption-key/versions/1"
        db_apikey_database_key_secret   = "secret://projects/979752996327/secrets/db-apikey-db-hmac/versions/1"
        db_apikey_signature_key_secret  = "secret://projects/979752996327/secrets/db-apikey-sig-hmac/versions/1"
        db_conn                         = "cw-en-verification-8:us-central1:en-verification"
        db_encryption_key_secret        = "projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter"
        db_host                         = "10.15.0.2"
        db_name                         = "verification"
        db_password                     = "projects/979752996327/secrets/db-password/versions/1"
        db_user                         = "verification"
        db_verification_code_key_secret = "secret://projects/979752996327/secrets/db-verification-code-hmac/versions/1"
      ~ e2e_runner_url                  = "" -> (known after apply)
        firebase_api_key                = "AIzaSyDBzUSZ95Il6Xa_7l9UX11qbr1gmOzinoQ"
        firebase_app_id                 = "1:979752996327:web:c8cf499d2a14d7d95d4142"
        firebase_auth_domain            = "cw-en-verification-8.firebaseapp.com"
        firebase_database_url           = "https://cw-en-verification-8.firebaseio.com"
        firebase_measurement_id         = ""
        firebase_messaging_sender_id    = "979752996327"
        firebase_project_id             = "cw-en-verification-8"
        firebase_storage_bucket         = "cw-en-verification-8.appspot.com"
        migrate_command                 = "PROJECT_ID=\"cw-en-verification-8\" DB_CONN=\"cw-en-verification-8:us-central1:en-verification\" DB_ENCRYPTION_KEY=\"projects/cw-en-verification-8/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter\" DB_APIKEY_DATABASE_KEY=\"secret://projects/979752996327/secrets/db-apikey-db-hmac/versions/1\" DB_APIKEY_SIGNATURE_KEY=\"secret://projects/979752996327/secrets/db-apikey-sig-hmac/versions/1\" DB_VERIFICATION_CODE_DATABASE_KEY=\"secret://projects/979752996327/secrets/db-verification-code-hmac/versions/1\" DB_PASSWORD=\"secret://projects/979752996327/secrets/db-password/versions/1\" DB_NAME=\"verification\" DB_USER=\"verification\" DB_DEBUG=\"true\" LOG_DEBUG=\"true\" ./scripts/migrate"
        next_steps                      = {
            enable_authentication_providers = "https://console.firebase.google.com/project/cw-en-verification-8/authentication/providers"
        }
        project_id                      = "cw-en-verification-8"
        project_number                  = "979752996327"
        proxy_command                   = "cloud_sql_proxy -dir \"${HOME}/sql\" -instances=cw-en-verification-8:us-central1:en-verification=tcp:5432"
        proxy_env                       = "DB_SSLMODE=disable DB_HOST=127.0.0.1 DB_NAME=verification DB_PORT=5432 DB_USER=verification DB_PASSWORD=$(gcloud secrets versions access projects/979752996327/secrets/db-password/versions/1)"
        psql_env                        = "PGHOST=127.0.0.1 PGPORT=5432 PGUSER=verification PGPASSWORD=$(gcloud secrets versions access projects/979752996327/secrets/db-password/versions/1)"
        redis_host                      = "10.15.1.4"
        redis_port                      = 6379
        region                          = "us-central1"
        server_url                      = "https://server-2ujofq5i2a-uc.a.run.app"
    }


Warning: "bucket_policy_only": [DEPRECATED] Please use the uniform_bucket_level_access as this field has been renamed by Google.

  on .terraform/modules/en/terraform/build.tf line 15, in resource "google_storage_bucket" "cloudbuild-cache":
  15: resource "google_storage_bucket" "cloudbuild-cache" {


Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.en.null_resource.migrate: Destroying... [id=4331290786721627435]
module.en.null_resource.migrate: Destruction complete after 0s
module.en.google_cloud_run_service.e2e-runner: Destroying... [id=locations/us-central1/namespaces/cw-en-verification-8/services/e2e-runner]
module.en.null_resource.migrate: Creating...
module.en.null_resource.migrate: Provisioning with 'local-exec'...
module.en.null_resource.migrate (local-exec): Executing: ["/bin/sh" "-c" ".terraform/modules/en/terraform/../scripts/migrate"]
module.en.google_cloud_run_service.e2e-runner: Destruction complete after 1s
module.en.google_cloud_run_service.e2e-runner: Creating...
module.en.null_resource.migrate (local-exec): Created [https://cloudbuild.googleapis.com/v1/projects/cw-en-verification-8/builds/4c0926d0-55a9-45fb-b6a3-72f709f7b88e].
module.en.null_resource.migrate (local-exec): Logs are available at [https://console.cloud.google.com/cloud-build/builds/4c0926d0-55a9-45fb-b6a3-72f709f7b88e?project=979752996327].
module.en.null_resource.migrate: Still creating... [10s elapsed]
module.en.google_cloud_run_service.e2e-runner: Still creating... [10s elapsed]
module.en.null_resource.migrate: Still creating... [20s elapsed]
module.en.null_resource.migrate (local-exec): ERROR: (gcloud.builds.submit) build 4c0926d0-55a9-45fb-b6a3-72f709f7b88e completed with status "FAILURE"
module.en.null_resource.migrate (local-exec): ---------------------------------------------------------------------------------------------- REMOTE BUILD OUTPUT ----------------------------------------------------------------------------------------------
module.en.null_resource.migrate (local-exec): starting build "4c0926d0-55a9-45fb-b6a3-72f709f7b88e"

module.en.null_resource.migrate (local-exec): FETCHSOURCE
module.en.null_resource.migrate (local-exec): BUILD
module.en.null_resource.migrate (local-exec): Pulling image: gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
module.en.null_resource.migrate (local-exec): ERROR: failed to pull because we ran out of retries.
module.en.null_resource.migrate (local-exec): ERROR
module.en.null_resource.migrate (local-exec): ERROR: build step 0 "gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0" failed: error pulling build step 0 "gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0": generic::unknown: retry budget exhausted (10 attempts): step exited with non-zero status: 1
module.en.null_resource.migrate (local-exec): -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



Error: Error running command '.terraform/modules/en/terraform/../scripts/migrate': exit status 1. Output: Created [https://cloudbuild.googleapis.com/v1/projects/cw-en-verification-8/builds/4c0926d0-55a9-45fb-b6a3-72f709f7b88e].
Logs are available at [https://console.cloud.google.com/cloud-build/builds/4c0926d0-55a9-45fb-b6a3-72f709f7b88e?project=979752996327].
ERROR: (gcloud.builds.submit) build 4c0926d0-55a9-45fb-b6a3-72f709f7b88e completed with status "FAILURE"
---------------------------------------------------------------------------------------------- REMOTE BUILD OUTPUT ----------------------------------------------------------------------------------------------
starting build "4c0926d0-55a9-45fb-b6a3-72f709f7b88e"

FETCHSOURCE
BUILD
Pulling image: gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
Error response from daemon: manifest for gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0 not found: manifest unknown: Failed to fetch "v0.7.0" from request "/v2/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate/manifests/v0.7.0".
ERROR: failed to pull because we ran out of retries.
ERROR
ERROR: build step 0 "gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0" failed: error pulling build step 0 "gcr.io/cw-en-verification-8/github.com/google/exposure-notifications-verification-server/migrate:v0.7.0": generic::unknown: retry budget exhausted (10 attempts): step exited with non-zero status: 1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------





Error: Error waiting to create Service: resource is in failed state "Ready:False", message: Cloud Run error: Container failed to start. Failed to start and then listen on the port defined by the PORT environment variable. Logs for this revision might contain more information.

  on .terraform/modules/en/terraform/service_e2e_runner.tf line 82, in resource "google_cloud_run_service" "e2e-runner":
  82: resource "google_cloud_run_service" "e2e-runner" {


zsombor@MacBook-Pro cw-en-verification-8 %
```